Охотники_и_рыболовы/src/Catalogs/СезоныОхоты/СезоныОхоты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СезоныОхоты</name>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СезонЗакрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Охотники_и_рыболовы/src/Catalogs/СезоныОхоты/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.СезонЗакрыт.Доступность = Ложь;
	Элементы.ДатаНачала.ТолькоПросмотр = Объект.СезонЗакрыт;
	Элементы.ДатаОкончания.ТолькоПросмотр = Объект.СезонЗакрыт;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИЗакрытьНаСервере()
	ОбъектЗначение = РеквизитФормыВЗначение("Объект",Тип("СправочникОбъект.СезоныОхоты"));
	Если НЕ ОхотаСервер.ИзменитьСезон(ОбъектЗначение) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Записать не удалось");
	КонецЕсли;	
	ЗначениеВРеквизитФормы(ОбъектЗначение,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьИЗакрытьНаСервере();
	ОповеститьОбИзменении(Объект.Ссылка);	
	Модифицированность = Ложь;
	Закрыть();
КонецПроцедуры
